app/controllers/news_articles_controller.rb

INSERT INTO "news_articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Maltese"], ["description", "Use the haptic TCP card, then you can parse the virtual card!"], ["created_at", "2019-09-13 17:56:54.227935"], ["updated_at", "2019-09-13 17:56:54.227935"]]
---
    def create
        @news_article = NewsArticle.new news_article_params
        @news_article.user_id = current_user
        if @news_article.save

SELECT "news_articles".* FROM "news_articles" WHERE "news_articles"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
    def show
        @news_article = NewsArticle.find(params[:id])

SELECT "news_articles".* FROM "news_articles" WHERE "news_articles"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
DELETE FROM "news_articles" WHERE "news_articles"."id" = $1  [["id", 62]]
---
    def destroy
        @news_article = NewsArticle.find(params[:id])
        @news_article.destroy

UPDATE "news_articles" SET "title" = $1, "updated_at" = $2 WHERE "news_articles"."id" = $3  [["title", "São Tomé And Príncipe New Changes"], ["updated_at", "2019-09-14 00:28:41.033316"], ["id", 464]]
---
    def update

        if !can?(:update, @news_article)
            redirect_to root_path
        end

       if @news_article.update news_article_params

SELECT "news_articles".* FROM "news_articles" WHERE "news_articles"."id" = $1 LIMIT $2  [["id", 450], ["LIMIT", 1]]
---
    def find_news_article
        @news_article = NewsArticle.find(params[:id])