app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @product = Product.new product_params
    if @product.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1 ORDER BY "reviews"."created_at" DESC  [["product_id", 2]]
---
  def show
    @review = Review.new
    @reviews = @product.reviews.order(created_at: :desc)

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", 4198.0], ["updated_at", "2019-09-09 16:09:12.986392"], ["id", 104]]
---
  def update
    if @product.update product_params

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 14]]
---
    def destroy
      flash[:notice] = "product deleted"
     @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1024], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:id])