app/controllers/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 108], ["LIMIT", 1]]
---
  def destroy
    @product = Product.find params[:product_id]