app/controllers/reviews_controller.rb

  def create
    @product = Product.find params[:product_id]
    @review = Review.new review_params
    @review.product = @product
    if @review.save
      redirect_to product_path(@product),
      notice: "review Added"
    else
      @reviews = @product.reviews.order(created_at: :desc)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1023], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "body", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 5], ["body", "dffadfsdf"], ["product_id", 2], ["created_at", "2019-09-06 22:49:46.883167"], ["updated_at", "2019-09-06 22:49:46.883167"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1 ORDER BY "reviews"."created_at" ASC  [["product_id", 2]]

  def destroy
    @product = Product.find params[:product_id]
    @review = Review.find params[:id]
    @review.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 20]]